Yujiro-13/micromouse-2026/sdkconfig.defaults
# ===== Target =====
# ESP32-S3 (hardware dependent, fixed)
CONFIG_IDF_TARGET="esp32s3"

# ===== Flash Settings =====
# 8MB flash / 80MHz (board dependent, do not change)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ===== Partition Table =====
# Use custom partition table (partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== CPU =====
# 240MHz (max, to keep control loop real-time)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ===== FreeRTOS =====
# Tick 1000Hz (1ms). vTaskDelay resolution affects control period, so fix it.
CONFIG_FREERTOS_HZ=1000

# ===== FATFS / Wear Levelling =====
# For log / parameter persistence (FAT partition). Sector size 4096.
CONFIG_FATFS_SECTOR_4096=y
CONFIG_WL_SECTOR_SIZE_4096=y
